index.org
#+TITLE:Awesomewm Fennel Config
#+AUTHOR:Samuel Wallace
#+OPTIONS:  num:nil
#+PROPERTY: header-args:fennel :tangle rc.fnl :comments no :exports code

* Intro

This is my [[https://awesomewm.org/][Awesomewm]] configuration file, written in [[https://fennel-lang.org/][the Fennel Language]]. Awesome is configured by writing code in Lua, and Fennel is a lisp-like language that compiles to Lua. Let's get into the code!

** Requirements

 - Awesome window manager
 - Fennel binary
 - acpi (requires modification if not)
 - feh for background

* Startup and Helpful functions

Let's start off by loading the awesome libraries:

#+BEGIN_src fennel

  (local gears (require :gears))
  (require "gears.surface")
  (local  awful (require :awful))
  (require "awful.autofocus")
  (local  wibox (require :wibox))
  (local  beautiful (require :beautiful))
  (local  naughty (require :naughty))
  (local  menubar (require :menubar))  
#+END_src

Now we can get into startup error checking:


#+BEGIN_src fennel

(if awesome.startup_errors
    (naughty.notify { :preset naughty.config.presets.critical
                      :title "Oops, there were errors during startup!"
                      :text awesome.startup_errors }))

(let [in-error false]
  (awesome.connect_signal
   "debug::error"
   (fn [err]
     (if in-error
         nil
         (let [in-error true]
           (naughty.notify { :preset naughty.config.presets.critical
                             :title "Oops, an error happened!"
                             :text (tostring err) }))))))
#+END_src

This is almost identical to the default startup error catching code.


* Theming and Locals

Use the Zenburn theme:


#+BEGIN_src fennel
(beautiful.init (.. (gears.filesystem.get_themes_dir) "zenburn/theme.lua"))
#+END_src

And we set up some local variables for program preferences, layouts, etc...


#+BEGIN_src fennel

  (local terminal "emacsclient -e '(shell)'")
  (local editor "emacsclient")
  (local editor-cmd "emacsclient")

  (local modkey "Mod4")
  (local fnlconf "~/.config/awesome/rc.fnl")

  (tset awful :layout :layouts [awful.layout.suit.tile.right
				awful.layout.suit.tile.top
				awful.layout.suit.max
				awful.layout.suit.floating])

  (fn preferred-layout [s] (naughty.notify {:text (.. "width " s.geometry.width " height " s.geometry.height)})
			     (if (>= s.geometry.width s.geometry.height)
				 1
				 2))

  (local menu [["quit" awesome.quit]
	       ["restart" awesome.restart]
	       ["edit config" (.. editor-cmd " " fnlconf)]
	       ["Emacs" (fn [] (awful.spawn "emacs"))]
	       ["Firefox" (fn [] (awful.spawn "firefox"))]
	       ["Zathura" (fn [] (awful.spawn "zathura"))]
	       ["Discord" (fn [] (awful.spawn "discord"))]])

  (local my-perm-tags ["E" "F" "Z" "D"])
#+END_src

~my-perm-tags~ are the tags that always stay available, one for each of the programs in the menu. Every other tag will be created and destroyed with new program launches and closes.

The menu item will become the launcher menu. I don't use the awesome default wallpapers, so I have the following:


#+BEGIN_src fennel

(fn set-wallpaper [s] (os.execute "/home/samueltwallace/.local/bin/fehbg"))

#+END_src

And the script there sets a random backgrouns through =feh --bg-fill --randomize \/my\/pic\/dir\/**= in a one-line script. I also have a cron job running that script on the hour.

