index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-05-27 Fri 20:49 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Awesomewm Fennel Config</title>
<meta name="author" content="Samuel Wallace" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Awesomewm Fennel Config</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org04f5444">Intro</a>
<ul>
<li><a href="#orgb415679">Requirements</a></li>
</ul>
</li>
<li><a href="#org8fa4806">Startup and Helpful functions</a></li>
<li><a href="#org496557a">Theming and Locals</a></li>
<li><a href="#org146903c">Menu, Widgets, and Tags</a></li>
<li><a href="#orgb6bc74c">Screen Connect</a></li>
<li><a href="#org30a1980">Keybindings</a></li>
<li><a href="#org8c45cdc">Rules</a></li>
<li><a href="#org76c4757">Signals and Workspace Assignment</a></li>
<li><a href="#org1b2d4b0">Startup Programs</a></li>
<li><a href="#org6386997">Final Notes</a></li>
</ul>
</div>
</div>

<div id="outline-container-org04f5444" class="outline-2">
<h2 id="org04f5444">Intro</h2>
<div class="outline-text-2" id="text-org04f5444">
<p>
This is my <a href="https://awesomewm.org/">Awesomewm</a> configuration file, written in <a href="https://fennel-lang.org/">the Fennel Language</a>. Awesome is configured by writing code in Lua, and Fennel is a lisp-like language that compiles to Lua. Let's get into the code!
</p>
</div>

<div id="outline-container-orgb415679" class="outline-3">
<h3 id="orgb415679">Requirements</h3>
<div class="outline-text-3" id="text-orgb415679">
<ul class="org-ul">
<li>Awesome window manager</li>
<li>Fennel binary</li>
<li>acpi (requires modification if not)</li>
<li>feh for background</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org8fa4806" class="outline-2">
<h2 id="org8fa4806">Startup and Helpful functions</h2>
<div class="outline-text-2" id="text-org8fa4806">
<p>
Let's start off by loading the awesome libraries:
</p>

<div class="org-src-container">
<pre class="src src-fennel">
(<span style="color: #b6a0ff; font-weight: bold;">local</span> <span style="color: #00d3d0;">gears</span> (<span style="color: #f78fe7;">require</span> <span style="color: #f78fe7;">:gears</span>))
(<span style="color: #f78fe7;">require</span> <span style="color: #79a8ff;">"gears.surface"</span>)
(<span style="color: #b6a0ff; font-weight: bold;">local</span>  <span style="color: #00d3d0;">awful</span> (<span style="color: #f78fe7;">require</span> <span style="color: #f78fe7;">:awful</span>))
(<span style="color: #f78fe7;">require</span> <span style="color: #79a8ff;">"awful.autofocus"</span>)
(<span style="color: #b6a0ff; font-weight: bold;">local</span>  <span style="color: #00d3d0;">wibox</span> (<span style="color: #f78fe7;">require</span> <span style="color: #f78fe7;">:wibox</span>))
(<span style="color: #b6a0ff; font-weight: bold;">local</span>  <span style="color: #00d3d0;">beautiful</span> (<span style="color: #f78fe7;">require</span> <span style="color: #f78fe7;">:beautiful</span>))
(<span style="color: #b6a0ff; font-weight: bold;">local</span>  <span style="color: #00d3d0;">naughty</span> (<span style="color: #f78fe7;">require</span> <span style="color: #f78fe7;">:naughty</span>))
(<span style="color: #b6a0ff; font-weight: bold;">local</span>  <span style="color: #00d3d0;">menubar</span> (<span style="color: #f78fe7;">require</span> <span style="color: #f78fe7;">:menubar</span>))  
</pre>
</div>

<p>
Now we can get into startup error checking:
</p>


<div class="org-src-container">
<pre class="src src-fennel">
(<span style="color: #b6a0ff; font-weight: bold;">if</span> <span style="color: #6ae4b9;">awesome.startup_errors</span>
    (<span style="color: #6ae4b9;">naughty.notify</span> { <span style="color: #f78fe7;">:preset</span> <span style="color: #6ae4b9;">naughty.config.presets.critical</span>
                      <span style="color: #f78fe7;">:title</span> <span style="color: #79a8ff;">"Oops, there were errors during startup!"</span>
                      <span style="color: #f78fe7;">:text</span> <span style="color: #6ae4b9;">awesome.startup_errors</span> }))

(<span style="color: #b6a0ff; font-weight: bold;">let</span> [in-error false]
  (<span style="color: #6ae4b9;">awesome.connect_signal</span>
   <span style="color: #79a8ff;">"debug::error"</span>
   (<span style="color: #b6a0ff; font-weight: bold;">fn</span> [err]
     (<span style="color: #b6a0ff; font-weight: bold;">if</span> in-error
         nil
         (<span style="color: #b6a0ff; font-weight: bold;">let</span> [in-error true]
           (<span style="color: #6ae4b9;">naughty.notify</span> { <span style="color: #f78fe7;">:preset</span> <span style="color: #6ae4b9;">naughty.config.presets.critical</span>
                             <span style="color: #f78fe7;">:title</span> <span style="color: #79a8ff;">"Oops, an error happened!"</span>
                             <span style="color: #f78fe7;">:text</span> (<span style="color: #f78fe7;">tostring</span> err) }))))))
</pre>
</div>

<p>
This is almost identical to the default startup error catching code.
</p>
</div>
</div>


<div id="outline-container-org496557a" class="outline-2">
<h2 id="org496557a">Theming and Locals</h2>
<div class="outline-text-2" id="text-org496557a">
<p>
Use the Zenburn theme:
</p>


<div class="org-src-container">
<pre class="src src-fennel">(<span style="color: #6ae4b9;">beautiful.init</span> (<span style="color: #b6a0ff; font-weight: bold;">..</span> (<span style="color: #6ae4b9;">gears.filesystem.get_themes_dir</span>) <span style="color: #79a8ff;">"zenburn/theme.lua"</span>))
</pre>
</div>

<p>
And we set up some local variables for program preferences, layouts, etc&#x2026;
</p>


<div class="org-src-container">
<pre class="src src-fennel">
(<span style="color: #b6a0ff; font-weight: bold;">local</span> <span style="color: #00d3d0;">terminal</span> <span style="color: #79a8ff;">"emacsclient -e '(shell)'"</span>)
(<span style="color: #b6a0ff; font-weight: bold;">local</span> <span style="color: #00d3d0;">editor</span> <span style="color: #79a8ff;">"emacsclient"</span>)
(<span style="color: #b6a0ff; font-weight: bold;">local</span> <span style="color: #00d3d0;">editor-cmd</span> <span style="color: #79a8ff;">"emacsclient"</span>)

(<span style="color: #b6a0ff; font-weight: bold;">local</span> <span style="color: #00d3d0;">modkey</span> <span style="color: #79a8ff;">"Mod4"</span>)
(<span style="color: #b6a0ff; font-weight: bold;">local</span> <span style="color: #00d3d0;">fnlconf</span> <span style="color: #79a8ff;">"~/.config/awesome/rc.fnl"</span>)

(<span style="color: #b6a0ff; font-weight: bold;">tset</span> awful <span style="color: #f78fe7;">:layout</span> <span style="color: #f78fe7;">:layouts</span> [<span style="color: #6ae4b9;">awful.layout.suit.tile.right</span>
                              <span style="color: #6ae4b9;">awful.layout.suit.tile.top</span>
                              <span style="color: #6ae4b9;">awful.layout.suit.max</span>
                              <span style="color: #6ae4b9;">awful.layout.suit.floating</span>])

(<span style="color: #b6a0ff; font-weight: bold;">fn</span> <span style="color: #feacd0;">preferred-layout</span> [s] (<span style="color: #b6a0ff; font-weight: bold;">do</span>
                           (<span style="color: #6ae4b9;">naughty.notify</span> {<span style="color: #f78fe7;">:text</span> (<span style="color: #b6a0ff; font-weight: bold;">..</span> <span style="color: #79a8ff;">"width "</span> <span style="color: #6ae4b9;">s.geometry.width</span> <span style="color: #79a8ff;">" height "</span> <span style="color: #6ae4b9;">s.geometry.height</span>)})
                           (<span style="color: #b6a0ff; font-weight: bold;">if</span> (<span style="color: #b6a0ff; font-weight: bold;">&gt;=</span> <span style="color: #6ae4b9;">s.geometry.width</span> <span style="color: #6ae4b9;">s.geometry.height</span>)
                               1
                           2)))

(<span style="color: #b6a0ff; font-weight: bold;">local</span> <span style="color: #00d3d0;">menu</span> [[<span style="color: #79a8ff;">"quit"</span> <span style="color: #6ae4b9;">awesome.quit</span>]
             [<span style="color: #79a8ff;">"restart"</span> <span style="color: #6ae4b9;">awesome.restart</span>]
             [<span style="color: #79a8ff;">"edit config"</span> (<span style="color: #b6a0ff; font-weight: bold;">..</span> editor-cmd <span style="color: #79a8ff;">" "</span> fnlconf)]
             [<span style="color: #79a8ff;">"Emacs"</span> (<span style="color: #b6a0ff; font-weight: bold;">fn</span> [] (<span style="color: #6ae4b9;">awful.spawn</span> <span style="color: #79a8ff;">"emacs"</span>))]
             [<span style="color: #79a8ff;">"Firefox"</span> (<span style="color: #b6a0ff; font-weight: bold;">fn</span> [] (<span style="color: #6ae4b9;">awful.spawn</span> <span style="color: #79a8ff;">"firefox"</span>))]
             [<span style="color: #79a8ff;">"Zathura"</span> (<span style="color: #b6a0ff; font-weight: bold;">fn</span> [] (<span style="color: #6ae4b9;">awful.spawn</span> <span style="color: #79a8ff;">"zathura"</span>))]
             [<span style="color: #79a8ff;">"Discord"</span> (<span style="color: #b6a0ff; font-weight: bold;">fn</span> [] (<span style="color: #6ae4b9;">awful.spawn</span> <span style="color: #79a8ff;">"discord"</span>))]])

(<span style="color: #b6a0ff; font-weight: bold;">local</span> <span style="color: #00d3d0;">my-perm-tags</span> [<span style="color: #79a8ff;">"E"</span> <span style="color: #79a8ff;">"F"</span> <span style="color: #79a8ff;">"Z"</span> <span style="color: #79a8ff;">"D"</span>])
</pre>
</div>

<p>
<code>my-perm-tags</code> are the tags that always stay available, one for each of the programs in the menu. Every other tag will be created and destroyed with new program launches and closes.
</p>

<p>
The menu item will become the launcher menu. I don't use the awesome default wallpapers, so I have the following:
</p>


<div class="org-src-container">
<pre class="src src-fennel">
(<span style="color: #b6a0ff; font-weight: bold;">fn</span> <span style="color: #feacd0;">set-wallpaper</span> [s] (<span style="color: #6ae4b9;">os.execute</span> <span style="color: #79a8ff;">"/home/samueltwallace/.local/bin/fehbg"</span>))

</pre>
</div>

<p>
And the script there sets a random backgrouns through <code>feh --bg-fill --randomize \/my\/pic\/dir\/**</code> in a one-line script. I also have a cron job running that script on the hour.
</p>
</div>
</div>
