index.org
* Menu, Widgets, and Tags

We make a menu with the awesome icon with the following:


#+BEGIN_src fennel
  (local mylauncher (awful.widget.launcher {:image beautiful.awesome_icon
					    :menu (awful.menu { :items menu })}))
#+END_src

Now we can make some widgets:


#+BEGIN_src fennel

  (local batt_bar (wibox.widget { :widget wibox.widget.progressbar
				  :forced_width 200
				  :shape gears.shape.rounded_bar
				  :bar_shape gears.shape.rounded_bar
				  :background_color "yellow"}))

  (local batt_hover (awful.tooltip {
				    :objects [batt_bar]
				    :timer_function (fn []
						      (let [batt_proc (io.popen "bash -c 'acpi -b'")
							    batt_str (batt_proc:read "*a")]
							(do
							  (batt_proc:close)
							  batt_str)))}))
  (local mytextclock (wibox.widget.textclock))

  (local taglist_buttons (gears.table.join
			  (awful.button { } 1 (fn [t] (t:view_only)))
			  (awful.button { } 3 awful.tag.viewtoggle)))

  (var batt_low false)

  (local batt_thresh 0.25)
#+END_src

The ~batt_bar~ variable saves a progressbar widget that will display battery. We will make a =watch= widget to get live updates later.

The ~batt_hover~ widget gives the ~batt_bar~ a hover popup that shows the output of =acpi -b= (requires =acpi=).

~batt_low~ and ~batt_thresh~ will be used later to track battery low notifications, and the latter is the 'threshold' for when the bar turns red and a notification gets sent.

~taglist_buttons~ says to show only the clicked tag if left clicked, and show the clicked tag as well as any previous tags if right clicked.

~mytextclock~ makes a widget for showing the current time in text.

~weather_box~ will show the weather in a textbox, =curl='ed from https://wttr.in

#+BEGIN_src fennel
  (local weather_box (wibox.widget {:widget wibox.widget.textbox
				    :text "No weather right now"}))
  
#+END_src

