index.html

<div id="outline-container-org146903c" class="outline-2">
<h2 id="org146903c">Menu, Widgets, and Tags</h2>
<div class="outline-text-2" id="text-org146903c">
<p>
We make a menu with the awesome icon with the following:
</p>


<div class="org-src-container">
<pre class="src src-fennel">(<span style="color: #b6a0ff; font-weight: bold;">local</span> <span style="color: #00d3d0;">mylauncher</span> (<span style="color: #6ae4b9;">awful.widget.launcher</span> {<span style="color: #f78fe7;">:image</span> <span style="color: #6ae4b9;">beautiful.awesome_icon</span>
                                          <span style="color: #f78fe7;">:menu</span> (<span style="color: #6ae4b9;">awful.menu</span> { <span style="color: #f78fe7;">:items</span> menu })}))
</pre>
</div>

<p>
Now we can make some widgets:
</p>


<div class="org-src-container">
<pre class="src src-fennel">
(<span style="color: #b6a0ff; font-weight: bold;">local</span> <span style="color: #00d3d0;">batt_bar</span> (<span style="color: #6ae4b9;">wibox.widget</span> { <span style="color: #f78fe7;">:widget</span> <span style="color: #6ae4b9;">wibox.widget.progressbar</span>
                                <span style="color: #f78fe7;">:forced_width</span> 200
                                <span style="color: #f78fe7;">:shape</span> <span style="color: #6ae4b9;">gears.shape.rounded_bar</span>
                                <span style="color: #f78fe7;">:bar_shape</span> <span style="color: #6ae4b9;">gears.shape.rounded_bar</span>
                                <span style="color: #f78fe7;">:background_color</span> <span style="color: #79a8ff;">"yellow"</span>}))

(<span style="color: #b6a0ff; font-weight: bold;">local</span> <span style="color: #00d3d0;">batt_hover</span> (<span style="color: #6ae4b9;">awful.tooltip</span> {
                                  <span style="color: #f78fe7;">:objects</span> [batt_bar]
                                  <span style="color: #f78fe7;">:timer_function</span> (<span style="color: #b6a0ff; font-weight: bold;">fn</span> []
                                                    (<span style="color: #b6a0ff; font-weight: bold;">let</span> [batt_proc (<span style="color: #6ae4b9;">io.popen</span> <span style="color: #79a8ff;">"bash -c 'acpi -b'"</span>)
                                                          batt_str (batt_proc<span style="color: #f78fe7;">:read</span> <span style="color: #79a8ff;">"*a"</span>)]
                                                      (<span style="color: #b6a0ff; font-weight: bold;">do</span>
                                                        (batt_proc<span style="color: #f78fe7;">:close</span>)
                                                        batt_str)))}))
(<span style="color: #b6a0ff; font-weight: bold;">local</span> <span style="color: #00d3d0;">mytextclock</span> (<span style="color: #6ae4b9;">wibox.widget.textclock</span>))

(<span style="color: #b6a0ff; font-weight: bold;">local</span> <span style="color: #00d3d0;">taglist_buttons</span> (<span style="color: #6ae4b9;">gears.table.join</span>
                        (<span style="color: #6ae4b9;">awful.button</span> { } 1 (<span style="color: #b6a0ff; font-weight: bold;">fn</span> [t] (t<span style="color: #f78fe7;">:view_only</span>)))
                        (<span style="color: #6ae4b9;">awful.button</span> { } 3 <span style="color: #6ae4b9;">awful.tag.viewtoggle</span>)))

(<span style="color: #b6a0ff; font-weight: bold;">var</span> <span style="color: #00d3d0;">batt_low</span> false)

(<span style="color: #b6a0ff; font-weight: bold;">local</span> <span style="color: #00d3d0;">batt_thresh</span> 0.25)
</pre>
</div>

<p>
The <code>batt_bar</code> variable saves a progressbar widget that will display battery. We will make a <code>watch</code> widget to get live updates later.
</p>

<p>
The <code>batt_hover</code> widget gives the <code>batt_bar</code> a hover popup that shows the output of <code>acpi -b</code> (requires <code>acpi</code>).
</p>

<p>
<code>batt_low</code> and <code>batt_thresh</code> will be used later to track battery low notifications, and the latter is the 'threshold' for when the bar turns red and a notification gets sent.
</p>

<p>
<code>taglist_buttons</code> says to show only the clicked tag if left clicked, and show the clicked tag as well as any previous tags if right clicked.
</p>

<p>
<code>mytextclock</code> makes a widget for showing the current time in text.
</p>

<p>
<code>weather_box</code> will show the weather in a textbox, <code>curl</code>'ed from <a href="https://wttr.in">https://wttr.in</a>
</p>

<div class="org-src-container">
<pre class="src src-fennel">(<span style="color: #b6a0ff; font-weight: bold;">local</span> <span style="color: #00d3d0;">weather_box</span> (<span style="color: #6ae4b9;">wibox.widget</span> {<span style="color: #f78fe7;">:widget</span> <span style="color: #6ae4b9;">wibox.widget.textbox</span>
                                  <span style="color: #f78fe7;">:text</span> <span style="color: #79a8ff;">"No weather right now"</span>}))

</pre>
</div>
</div>
</div>
