index.html

<div id="outline-container-orgb6bc74c" class="outline-2">
<h2 id="orgb6bc74c">Screen Connect</h2>
<div class="outline-text-2" id="text-orgb6bc74c">
<p>
Now we'll start to put some of these variables into action! We will call <code>connect_for_each_screen</code> to set up behavior for each screen.
</p>

<p>
I'll comment through the large code block below rather than separately annotating.
</p>


<div class="org-src-container">
<pre class="src src-fennel">(<span style="color: #6ae4b9;">awful.screen.connect_for_each_screen</span>
 (<span style="color: #b6a0ff; font-weight: bold;">fn</span> [s]
   (<span style="color: #b6a0ff; font-weight: bold;">do</span>
     (set-wallpaper s) <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">set wallpaper on each screen</span>
     (<span style="color: #6ae4b9;">awful.tag</span> my-perm-tags s (<span style="color: #b6a0ff; font-weight: bold;">.</span> <span style="color: #6ae4b9;">awful.layout.layouts</span> (preferred-layout s)))
     (<span style="color: #b6a0ff; font-weight: bold;">tset</span> s <span style="color: #f78fe7;">:mypromptbox</span> (<span style="color: #6ae4b9;">awful.widget.prompt</span>)) <span style="color: #a8a8a8;">;;</span><span style="color: #a8a8a8;">have a prompt box</span>
     (<span style="color: #b6a0ff; font-weight: bold;">tset</span> s <span style="color: #f78fe7;">:mylayoutbox</span> (<span style="color: #6ae4b9;">awful.widget.layoutbox</span> s)) <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">have a box showing current layout</span>
     (s.mylayoutbox<span style="color: #f78fe7;">:buttons</span> (<span style="color: #6ae4b9;">awful.button</span> {} 1 (<span style="color: #b6a0ff; font-weight: bold;">fn</span> [] (<span style="color: #6ae4b9;">awful.layout.inc</span> 1))) ) <span style="color: #a8a8a8;">;;</span><span style="color: #a8a8a8;">clicking on layoutbox advances the layouts through the list</span>
     (<span style="color: #b6a0ff; font-weight: bold;">tset</span> s <span style="color: #f78fe7;">:mytaglist</span> (<span style="color: #6ae4b9;">awful.widget.taglist</span> {
                                             <span style="color: #f78fe7;">:screen</span> s
                                             <span style="color: #f78fe7;">:filter</span> <span style="color: #6ae4b9;">awful.widget.taglist.filter.noempty</span> <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">only show tags which are not empty</span>
                                             <span style="color: #f78fe7;">:buttons</span> taglist_buttons})) <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">click the taglist by the predefined buttons</span>
     (<span style="color: #b6a0ff; font-weight: bold;">tset</span> s <span style="color: #f78fe7;">:mytasklist</span> (<span style="color: #6ae4b9;">awful.widget.tasklist</span> { <span style="color: #f78fe7;">:screen</span> s
                                                <span style="color: #f78fe7;">:filter</span> <span style="color: #6ae4b9;">awful.widget.tasklist.filter.currenttags</span>})) <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">show the icons and names of windows in the current tag(s)</span>
     (<span style="color: #b6a0ff; font-weight: bold;">tset</span> s <span style="color: #f78fe7;">:mywibox</span> (<span style="color: #6ae4b9;">awful.wibar</span> { <span style="color: #f78fe7;">:position</span> <span style="color: #79a8ff;">"top"</span> <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">show bar across top of screen</span>
                                     <span style="color: #f78fe7;">:screen</span> s }))
     (s.mywibox<span style="color: #f78fe7;">:setup</span> { <span style="color: #f78fe7;">:layout</span> <span style="color: #6ae4b9;">wibox.layout.align.horizontal</span> <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">horizontal layout for the whole bar</span>
                        1 { <span style="color: #f78fe7;">:layout</span> <span style="color: #6ae4b9;">wibox.layout.fixed.horizontal</span> <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">horizontal layout for the left side</span>
                            1 mylauncher
                            2 <span style="color: #6ae4b9;">s.mytaglist</span>
                            3 <span style="color: #6ae4b9;">s.mypromptbox</span> }
                        2 <span style="color: #6ae4b9;">s.mytasklist</span> <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">middle widget</span>
                        3  { <span style="color: #f78fe7;">:layout</span> <span style="color: #6ae4b9;">wibox.layout.fixed.horizontal</span> <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">horizontal layout for right side</span>
                            1 (<span style="color: #6ae4b9;">awful.widget.watch</span> <span style="color: #79a8ff;">"bash -c 'curl -s https://wttr.in/chicago?format=3'"</span> <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">take from wttr.in</span>
                                                  600 <span style="color: #a8a8a8;">;;</span><span style="color: #a8a8a8;">refresh every 5 mins</span>
                                                  (<span style="color: #b6a0ff; font-weight: bold;">fn</span> [widget stdout]
                                                      (<span style="color: #b6a0ff; font-weight: bold;">tset</span> widget <span style="color: #f78fe7;">:text</span> stdout)) <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">make it weather_box text</span>
                                                  weather_box)
                            2 (<span style="color: #6ae4b9;">wibox.widget.systray</span>)
                            3 (<span style="color: #6ae4b9;">awful.widget.watch</span> <span style="color: #79a8ff;">"bash -c 'acpi -b'"</span> <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">watching battery updates</span>
                                                  30 <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">recall every 30 secs</span>
                                                  (<span style="color: #b6a0ff; font-weight: bold;">fn</span> [widget stdout] <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">here is fn to be called after calling acpi</span>
                                                    (<span style="color: #b6a0ff; font-weight: bold;">let</span> [batt_percent (<span style="color: #b6a0ff; font-weight: bold;">/</span> (<span style="color: #f78fe7;">tonumber</span> (<span style="color: #6ae4b9;">string.match</span> stdout <span style="color: #79a8ff;">"(%d+)%%"</span>)) 100)] <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">get battery percentage as decimal</span>
                                                      (<span style="color: #b6a0ff; font-weight: bold;">do</span>
                                                        (widget<span style="color: #f78fe7;">:set_value</span> batt_percent) <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">set progressbar to show batt_percent full</span>
                                                        (<span style="color: #b6a0ff; font-weight: bold;">if</span> (<span style="color: #b6a0ff; font-weight: bold;">and</span> (<span style="color: #b6a0ff; font-weight: bold;">&lt;</span> batt_percent batt_thresh) <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">if we are hitting batt_thresh for first time, then</span>
                                                                 (<span style="color: #b6a0ff; font-weight: bold;">not</span> batt_low))
                                                            (<span style="color: #b6a0ff; font-weight: bold;">do</span>
                                                              (<span style="color: #6ae4b9;">naughty.notify</span> {<span style="color: #f78fe7;">:title</span> <span style="color: #79a8ff;">"Battery Low!"</span> <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">notify about low battery</span>
                                                                               <span style="color: #f78fe7;">:preset</span> <span style="color: #6ae4b9;">naughty.config.presets.critical</span>})
                                                              (<span style="color: #b6a0ff; font-weight: bold;">set</span> batt_low true)))
                                                        (<span style="color: #b6a0ff; font-weight: bold;">if</span> (<span style="color: #b6a0ff; font-weight: bold;">&lt;</span> batt_percent batt_thresh) <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">if low battery</span>
                                                            (<span style="color: #b6a0ff; font-weight: bold;">tset</span> widget <span style="color: #f78fe7;">:color</span> <span style="color: #79a8ff;">"red"</span>) <span style="color: #a8a8a8;">;;</span><span style="color: #a8a8a8;">set bar color red</span>
                                                            (<span style="color: #b6a0ff; font-weight: bold;">do</span> <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">otherwise set green and mark no low battery</span>
                                                              (<span style="color: #b6a0ff; font-weight: bold;">tset</span> widget <span style="color: #f78fe7;">:color</span> <span style="color: #79a8ff;">"green"</span>)
                                                              (<span style="color: #b6a0ff; font-weight: bold;">set</span> batt_low false)))))) <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">need to check delims here, org mode matches &lt; and )</span>
                                                  batt_bar)
                            4 mytextclock <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">clock</span>
                            5 <span style="color: #6ae4b9;">s.mylayoutbox</span>}})))) <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">show layout</span>
</pre>
</div>
</div>
</div>
