index.html

<div id="outline-container-org30a1980" class="outline-2">
<h2 id="org30a1980">Keybindings</h2>
<div class="outline-text-2" id="text-org30a1980">
<p>
We'll set up a variable for all the window management keybindings:
</p>


<div class="org-src-container">
<pre class="src src-fennel">
(<span style="color: #b6a0ff; font-weight: bold;">var</span> <span style="color: #00d3d0;">globalkeys</span> (<span style="color: #6ae4b9;">gears.table.join</span>
                   (<span style="color: #6ae4b9;">awful.key</span> [modkey] <span style="color: #79a8ff;">"Left"</span> <span style="color: #6ae4b9;">awful.tag.viewprev</span>)
                   (<span style="color: #6ae4b9;">awful.key</span> [modkey] <span style="color: #79a8ff;">"Right"</span> <span style="color: #6ae4b9;">awful.tag.viewnext</span>)
                   (<span style="color: #6ae4b9;">awful.key</span> [modkey] <span style="color: #79a8ff;">"Escape"</span> <span style="color: #6ae4b9;">awful.tag.history.restore</span>)
                   (<span style="color: #6ae4b9;">awful.key</span> [modkey] <span style="color: #79a8ff;">"j"</span> (<span style="color: #b6a0ff; font-weight: bold;">fn</span> [] (<span style="color: #6ae4b9;">awful.client.focus.byidx</span> 1)))
                   (<span style="color: #6ae4b9;">awful.key</span> [modkey] <span style="color: #79a8ff;">"k"</span> (<span style="color: #b6a0ff; font-weight: bold;">fn</span> [] (<span style="color: #6ae4b9;">awful.client.focus.byidx</span> -1)))
                   (<span style="color: #6ae4b9;">awful.key</span> [modkey <span style="color: #79a8ff;">"Control"</span>] <span style="color: #79a8ff;">"r"</span> <span style="color: #6ae4b9;">awesome.restart</span>)
                   (<span style="color: #6ae4b9;">awful.key</span> [modkey <span style="color: #79a8ff;">"Shift"</span>] <span style="color: #79a8ff;">"j"</span> (<span style="color: #b6a0ff; font-weight: bold;">fn</span> [] (<span style="color: #6ae4b9;">awful.client.swap.byidx</span> 1)))
                   (<span style="color: #6ae4b9;">awful.key</span> [modkey <span style="color: #79a8ff;">"Shift"</span>] <span style="color: #79a8ff;">"k"</span> (<span style="color: #b6a0ff; font-weight: bold;">fn</span> [] (<span style="color: #6ae4b9;">awful.client.swap.byidx</span> -1)))
                   (<span style="color: #6ae4b9;">awful.key</span> [modkey] <span style="color: #79a8ff;">"Tab"</span> (<span style="color: #b6a0ff; font-weight: bold;">fn</span> [] (<span style="color: #6ae4b9;">awful.screen.focus_relative</span> 1)))
                   (<span style="color: #6ae4b9;">awful.key</span> [modkey] <span style="color: #79a8ff;">"u"</span> <span style="color: #6ae4b9;">awful.client.urgent.jumpto</span>)
                   (<span style="color: #6ae4b9;">awful.key</span> [modkey] <span style="color: #79a8ff;">"g"</span> (<span style="color: #b6a0ff; font-weight: bold;">fn</span> [] (<span style="color: #6ae4b9;">awful.spawn</span> <span style="color: #79a8ff;">"i3lock -c 000000"</span>)))
                   (<span style="color: #6ae4b9;">awful.key</span> [modkey] <span style="color: #79a8ff;">"space"</span> (<span style="color: #b6a0ff; font-weight: bold;">fn</span> [] (<span style="color: #6ae4b9;">menubar.show</span>)))))
</pre>
</div>

<p>
Now we'll do the only client key I want to do: set to full screen.
</p>


<div class="org-src-container">
<pre class="src src-fennel">
(<span style="color: #b6a0ff; font-weight: bold;">local</span> <span style="color: #00d3d0;">clientkeys</span> (<span style="color: #6ae4b9;">gears.table.join</span>
                   (<span style="color: #6ae4b9;">awful.key</span> [modkey] <span style="color: #79a8ff;">"f"</span> (<span style="color: #b6a0ff; font-weight: bold;">fn</span> [c] (<span style="color: #b6a0ff; font-weight: bold;">do</span>
                                                     (<span style="color: #b6a0ff; font-weight: bold;">tset</span> c <span style="color: #f78fe7;">:fullscreen</span> (<span style="color: #b6a0ff; font-weight: bold;">not</span> <span style="color: #6ae4b9;">c.fullscreen</span>))
                                                     (c<span style="color: #f78fe7;">:raise</span>))))))
</pre>
</div>

<p>
Now we'll switch between workspaces with the <code>modkey</code> and a number, as many as there are elements in <code>my-perm-tags</code>.
</p>


<div class="org-src-container">
<pre class="src src-fennel">
(<span style="color: #b6a0ff; font-weight: bold;">each</span> [idx tag-name (<span style="color: #f78fe7;">pairs</span> my-perm-tags)]
  (<span style="color: #b6a0ff; font-weight: bold;">set</span> globalkeys (<span style="color: #6ae4b9;">gears.table.join</span> globalkeys
                                    (<span style="color: #6ae4b9;">awful.key</span> [modkey] (<span style="color: #b6a0ff; font-weight: bold;">..</span> <span style="color: #79a8ff;">"#"</span> (<span style="color: #b6a0ff; font-weight: bold;">+</span> idx 9)) (<span style="color: #b6a0ff; font-weight: bold;">fn</span> [] <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">on modkey + number keypress, </span>
                                                                       (<span style="color: #b6a0ff; font-weight: bold;">let</span> [screen (<span style="color: #6ae4b9;">awful.screen.focused</span>)
                                                                             tag (<span style="color: #b6a0ff; font-weight: bold;">.</span> <span style="color: #6ae4b9;">screen.tags</span> idx)]
                                                                         (<span style="color: #b6a0ff; font-weight: bold;">if</span> tag
                                                                             (tag<span style="color: #f78fe7;">:view_only</span>)) <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">view only the pressed tag.</span>
                                                                       )))
                                    (<span style="color: #6ae4b9;">awful.key</span> [modkey <span style="color: #79a8ff;">"Control"</span>] (<span style="color: #b6a0ff; font-weight: bold;">..</span> <span style="color: #79a8ff;">"#"</span> (<span style="color: #b6a0ff; font-weight: bold;">+</span> idx 9)) (<span style="color: #b6a0ff; font-weight: bold;">fn</span> [] <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">on modkey + control + number,</span>
                                                                                 (<span style="color: #b6a0ff; font-weight: bold;">let</span> [screen (<span style="color: #6ae4b9;">awful.screen.focused</span>)
                                                                                       tag (<span style="color: #b6a0ff; font-weight: bold;">.</span> <span style="color: #6ae4b9;">screen.tags</span> idx)]
                                                                                   (<span style="color: #b6a0ff; font-weight: bold;">if</span> tag
                                                                                       (<span style="color: #6ae4b9;">awful.tag.viewtoggle</span> tag))))) <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">view pressed tag as well.</span>
                                    (<span style="color: #6ae4b9;">awful.key</span> [modkey <span style="color: #79a8ff;">"Shift"</span>] (<span style="color: #b6a0ff; font-weight: bold;">..</span> <span style="color: #79a8ff;">"#"</span> (<span style="color: #b6a0ff; font-weight: bold;">+</span> idx 9)) (<span style="color: #b6a0ff; font-weight: bold;">fn</span> [] <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">on modkey + shift + number,</span>
                                                                               (<span style="color: #b6a0ff; font-weight: bold;">if</span> <span style="color: #6ae4b9;">client.focus</span>
                                                                                   (<span style="color: #b6a0ff; font-weight: bold;">let</span> [tag (<span style="color: #b6a0ff; font-weight: bold;">.</span> <span style="color: #6ae4b9;">client.focus.screen.tags</span> i)]
                                                                                     (<span style="color: #b6a0ff; font-weight: bold;">if</span> tag
                                                                                         (client.focus<span style="color: #f78fe7;">:move_to_tag</span> tag))))))))) <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">move client to pressed tag.</span>

</pre>
</div>

<p>
And let's set the keys:
</p>


<div class="org-src-container">
<pre class="src src-fennel">
(<span style="color: #6ae4b9;">root.keys</span> globalkeys)

</pre>
</div>
</div>
</div>
