index.org
* Rules

Most of this is fairly standard... note the end though!


#+BEGIN_src fennel
(tset awful.rules :rules [
                         { :rule { } ;; default for all windows
                           :properties {
                                        :border_width beautiful.border_width
                                        :border_color beautiful.border_normal
                                        :focus awful.client.focus.filter
                                        :raise true
                                        :keys clientkeys
                                        :screen awful.screen.preferred
                                        :placement (+ awful.placement.no_overlap awful.placement.no_offscreen)}}
                         { :rule { :class "Emacs" } ;; emacs will end up
                           :properties { :screen (screen.count) ;; on highest number screen
                                         :tag "E" }} ;; on tag "E"
                         {:rule { :class "firefox" } ;; firefox will end up
                          :properties { :tag "F" }} ;; on tag "F"
                         {:rule { :class "Zathura"} ;; Zathura will end up
                          :properties {:tag "Z"}} ;; on tag "Z"
                         {:rule {:class "discord" } ;; and discord
                          :properties {:tag "D"}} ]) ;; on tag "D"
#+END_src

* Signals and Workspace Assignment

Now we look at manage and unmanage signals. When we manage a new window, if it is not a commonly used program, put it on a new tag with name and icon matching program. Otherwise it goes to a perm-tag.


#+BEGIN_src fennel
(client.connect_signal "manage" (fn [c]
                                  (if (and
                                       awesome.startup
                                       (not c.size_hints.user_position)
                                       (not c.size_hints.program_position))
                                      (awful.placement.no_offscreen c))
                                  (if (not (or
                                       (= c.class "Emacs")
                                       (= c.class "Zathura")
                                       (= c.class "firefox")
                                       (= c.class "discord")))
                                      (let [t (awful.tag.add c.class {:screen c.screen
                                                                      :icon (gears.surface.duplicate_surface c.icon)})]
                                        (c:tags [t])))))

#+END_src

For an unmanage signal, we delete the tag it's from if it's not on a perm-tag. We also notify that the tag was deleted.


#+BEGIN_src fennel

(fn is-tag-by-name [tag name]
  (= tag (awful.tag.find_by_name (awful.screen.focused) name)))


(client.connect_signal "unmanage" (fn [c]
                                    (each [_ tag (ipairs c.screen.tags)]
                                      (if (not (or
                                           (. (tag:clients) 1)
                                           (is-tag-by-name tag "E")
                                           (is-tag-by-name tag "F")
                                           (is-tag-by-name tag "Z")
                                           (is-tag-by-name tag "D")))
                                          (do (tag:delete)
                                              (naughty.notify {:text (.. "tag " tag.name " deleted!")
                                                               :preset naughty.config.presets.critical})))))) 

#+END_src

Now, we focus a window if mouse enters (sloppy focus)


#+BEGIN_src fennel
(client.connect_signal "mouse::enter" (fn [c]
                                        (c:emit_signal
                                         "request::activate"
                                         "mouse_enter"
                                         {:raise false})
nil))
#+END_src

* Startup Programs

Start Emacs if not running:


#+BEGIN_src fennel

(awful.spawn "pgrep emacs || emacs")

#+END_src

* Final Notes

That's it! This slimmed down the default config by a factor of 2 or so, though some stuff is taken out to my preference. You can generate the config with =fennel --compile rc.fnl > rc.lua=. 

