index.html

<div id="outline-container-org8c45cdc" class="outline-2">
<h2 id="org8c45cdc">Rules</h2>
<div class="outline-text-2" id="text-org8c45cdc">
<p>
Most of this is fairly standard&#x2026; note the end though!
</p>


<div class="org-src-container">
<pre class="src src-fennel">(<span style="color: #b6a0ff; font-weight: bold;">tset</span> <span style="color: #6ae4b9;">awful.rules</span> <span style="color: #f78fe7;">:rules</span> [
                         { <span style="color: #f78fe7;">:rule</span> { } <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">default for all windows</span>
                           <span style="color: #f78fe7;">:properties</span> {
                                        <span style="color: #f78fe7;">:border_width</span> <span style="color: #6ae4b9;">beautiful.border_width</span>
                                        <span style="color: #f78fe7;">:border_color</span> <span style="color: #6ae4b9;">beautiful.border_normal</span>
                                        <span style="color: #f78fe7;">:focus</span> <span style="color: #6ae4b9;">awful.client.focus.filter</span>
                                        <span style="color: #f78fe7;">:raise</span> true
                                        <span style="color: #f78fe7;">:keys</span> clientkeys
                                        <span style="color: #f78fe7;">:screen</span> <span style="color: #6ae4b9;">awful.screen.preferred</span>
                                        <span style="color: #f78fe7;">:placement</span> (<span style="color: #b6a0ff; font-weight: bold;">+</span> <span style="color: #6ae4b9;">awful.placement.no_overlap</span> <span style="color: #6ae4b9;">awful.placement.no_offscreen</span>)}}
                         { <span style="color: #f78fe7;">:rule</span> { <span style="color: #f78fe7;">:class</span> <span style="color: #79a8ff;">"Emacs"</span> } <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">emacs will end up</span>
                           <span style="color: #f78fe7;">:properties</span> { <span style="color: #f78fe7;">:screen</span> (<span style="color: #6ae4b9;">screen.count</span>) <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">on highest number screen</span>
                                         <span style="color: #f78fe7;">:tag</span> <span style="color: #79a8ff;">"E"</span> }} <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">on tag "E"</span>
                         {<span style="color: #f78fe7;">:rule</span> { <span style="color: #f78fe7;">:class</span> <span style="color: #79a8ff;">"firefox"</span> } <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">firefox will end up</span>
                          <span style="color: #f78fe7;">:properties</span> { <span style="color: #f78fe7;">:tag</span> <span style="color: #79a8ff;">"F"</span> }} <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">on tag "F"</span>
                         {<span style="color: #f78fe7;">:rule</span> { <span style="color: #f78fe7;">:class</span> <span style="color: #79a8ff;">"Zathura"</span>} <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">Zathura will end up</span>
                          <span style="color: #f78fe7;">:properties</span> {<span style="color: #f78fe7;">:tag</span> <span style="color: #79a8ff;">"Z"</span>}} <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">on tag "Z"</span>
                         {<span style="color: #f78fe7;">:rule</span> {<span style="color: #f78fe7;">:class</span> <span style="color: #79a8ff;">"discord"</span> } <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">and discord</span>
                          <span style="color: #f78fe7;">:properties</span> {<span style="color: #f78fe7;">:tag</span> <span style="color: #79a8ff;">"D"</span>}} ]) <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">on tag "D"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org76c4757" class="outline-2">
<h2 id="org76c4757">Signals and Workspace Assignment</h2>
<div class="outline-text-2" id="text-org76c4757">
<p>
Now we look at manage and unmanage signals. When we manage a new window, if it is not a commonly used program, put it on a new tag with name and icon matching program. Otherwise it goes to a perm-tag.
</p>


<div class="org-src-container">
<pre class="src src-fennel">(<span style="color: #6ae4b9;">client.connect_signal</span> <span style="color: #79a8ff;">"manage"</span> (<span style="color: #b6a0ff; font-weight: bold;">fn</span> [c]
                                  (<span style="color: #b6a0ff; font-weight: bold;">if</span> (<span style="color: #b6a0ff; font-weight: bold;">and</span>
                                       <span style="color: #6ae4b9;">awesome.startup</span>
                                       (<span style="color: #b6a0ff; font-weight: bold;">not</span> <span style="color: #6ae4b9;">c.size_hints.user_position</span>)
                                       (<span style="color: #b6a0ff; font-weight: bold;">not</span> <span style="color: #6ae4b9;">c.size_hints.program_position</span>))
                                      (<span style="color: #6ae4b9;">awful.placement.no_offscreen</span> c))
                                  (<span style="color: #b6a0ff; font-weight: bold;">if</span> (<span style="color: #b6a0ff; font-weight: bold;">not</span> (<span style="color: #b6a0ff; font-weight: bold;">or</span>
                                       (<span style="color: #b6a0ff; font-weight: bold;">=</span> <span style="color: #6ae4b9;">c.class</span> <span style="color: #79a8ff;">"Emacs"</span>)
                                       (<span style="color: #b6a0ff; font-weight: bold;">=</span> <span style="color: #6ae4b9;">c.class</span> <span style="color: #79a8ff;">"Zathura"</span>)
                                       (<span style="color: #b6a0ff; font-weight: bold;">=</span> <span style="color: #6ae4b9;">c.class</span> <span style="color: #79a8ff;">"firefox"</span>)
                                       (<span style="color: #b6a0ff; font-weight: bold;">=</span> <span style="color: #6ae4b9;">c.class</span> <span style="color: #79a8ff;">"discord"</span>)))
                                      (<span style="color: #b6a0ff; font-weight: bold;">let</span> [t (<span style="color: #6ae4b9;">awful.tag.add</span> <span style="color: #6ae4b9;">c.class</span> {<span style="color: #f78fe7;">:screen</span> <span style="color: #6ae4b9;">c.screen</span>
                                                                      <span style="color: #f78fe7;">:icon</span> (<span style="color: #6ae4b9;">gears.surface.duplicate_surface</span> <span style="color: #6ae4b9;">c.icon</span>)})]
                                        (c<span style="color: #f78fe7;">:tags</span> [t])))))

</pre>
</div>

<p>
For an unmanage signal, we delete the tag it's from if it's not on a perm-tag. We also notify that the tag was deleted.
</p>


<div class="org-src-container">
<pre class="src src-fennel">
(<span style="color: #b6a0ff; font-weight: bold;">fn</span> <span style="color: #feacd0;">is-tag-by-name</span> [tag name]
  (<span style="color: #b6a0ff; font-weight: bold;">=</span> tag (<span style="color: #6ae4b9;">awful.tag.find_by_name</span> (<span style="color: #6ae4b9;">awful.screen.focused</span>) name)))


(<span style="color: #6ae4b9;">client.connect_signal</span> <span style="color: #79a8ff;">"unmanage"</span> (<span style="color: #b6a0ff; font-weight: bold;">fn</span> [c]
                                    (<span style="color: #b6a0ff; font-weight: bold;">each</span> [_ tag (<span style="color: #f78fe7;">ipairs</span> <span style="color: #6ae4b9;">c.screen.tags</span>)]
                                      (<span style="color: #b6a0ff; font-weight: bold;">if</span> (<span style="color: #b6a0ff; font-weight: bold;">not</span> (<span style="color: #b6a0ff; font-weight: bold;">or</span>
                                           (<span style="color: #b6a0ff; font-weight: bold;">.</span> (tag<span style="color: #f78fe7;">:clients</span>) 1)
                                           (is-tag-by-name tag <span style="color: #79a8ff;">"E"</span>)
                                           (is-tag-by-name tag <span style="color: #79a8ff;">"F"</span>)
                                           (is-tag-by-name tag <span style="color: #79a8ff;">"Z"</span>)
                                           (is-tag-by-name tag <span style="color: #79a8ff;">"D"</span>)))
                                          (<span style="color: #b6a0ff; font-weight: bold;">do</span> (tag<span style="color: #f78fe7;">:delete</span>)
                                              (<span style="color: #6ae4b9;">naughty.notify</span> {<span style="color: #f78fe7;">:text</span> (<span style="color: #b6a0ff; font-weight: bold;">..</span> <span style="color: #79a8ff;">"tag "</span> <span style="color: #6ae4b9;">tag.name</span> <span style="color: #79a8ff;">" deleted!"</span>)
                                                               <span style="color: #f78fe7;">:preset</span> <span style="color: #6ae4b9;">naughty.config.presets.critical</span>})))))) 

</pre>
</div>

<p>
Now, we focus a window if mouse enters (sloppy focus)
</p>


<div class="org-src-container">
<pre class="src src-fennel">(<span style="color: #6ae4b9;">client.connect_signal</span> <span style="color: #79a8ff;">"mouse::enter"</span> (<span style="color: #b6a0ff; font-weight: bold;">fn</span> [c]
                                        (c<span style="color: #f78fe7;">:emit_signal</span>
                                         <span style="color: #79a8ff;">"request::activate"</span>
                                         <span style="color: #79a8ff;">"mouse_enter"</span>
                                         {<span style="color: #f78fe7;">:raise</span> false})
nil))
</pre>
</div>
</div>
</div>

<div id="outline-container-org1b2d4b0" class="outline-2">
<h2 id="org1b2d4b0">Startup Programs</h2>
<div class="outline-text-2" id="text-org1b2d4b0">
<p>
Start Emacs if not running:
</p>


<div class="org-src-container">
<pre class="src src-fennel">
(<span style="color: #6ae4b9;">awful.spawn</span> <span style="color: #79a8ff;">"pgrep emacs || emacs"</span>)

</pre>
</div>
</div>
</div>

<div id="outline-container-org6386997" class="outline-2">
<h2 id="org6386997">Final Notes</h2>
<div class="outline-text-2" id="text-org6386997">
<p>
That's it! This slimmed down the default config by a factor of 2 or so, though some stuff is taken out to my preference. You can generate the config with <code>fennel --compile rc.fnl &gt; rc.lua</code>. 
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Samuel Wallace</p>
<p class="date">Created: 2022-05-27 Fri 20:49</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
